// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "致我亲爱的珊大人", 
        "又到你的生日啦", 
        "生日快乐呀！", //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "已经是我陪你过的第二个生日啦",  // 同上...
        "时间真的过得很快",
        "今天已经是我们开始的第534天啦",
        "我们一起走过贵州",
        "一起走过重庆",
        "走过渭南",
        "520",
        "圣诞",
        "七夕",
        "也从不缺席",
        "我爱这生活，不断努力",
        "皆是因为有你",
        "感谢你带给我的每一天❤",
        "生日快乐老婆！",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        //"在遠方送上最近的祝福": "./imgs/1.png",
        //"願你下雨時身邊有傘": "./imgs/2.png",  
        //"願你每次跑圖都炸花": "./imgs/3.png",
        //"願你抬頭便有美麗的天空": "./imgs/4.png",
        "我们一起走过贵州": "./imgs/5.png",
        "一起走过重庆": "./imgs/6.png",
        "走过渭南": "./imgs/7.png",
        "520": "./imgs/8.png",
        "圣诞": "./imgs/9.png",
        "七夕": "./imgs/10.png",

        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始",
        play: "音乐",
        bannar_coming: "横幅~",
        balloons_flying: "好像少点东西呢...",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐！",
        story: "A MESSAGE FOR YOU",
    }
};
